"""
█████████████████████████████████████████████████████████████████████
█░░░░░░██░░░░░░█░░░░░░░░░░░░░░░░███░░░░░░░░░░░░░░█░░░░░░░░██░░░░░░░░█
█░░▄▀░░██░░▄▀░░█░░▄▀▄▀▄▀▄▀▄▀▄▀░░███░░▄▀▄▀▄▀▄▀▄▀░░█░░▄▀▄▀░░██░░▄▀▄▀░░█
█░░▄▀░░██░░▄▀░░█░░▄▀░░░░░░░░▄▀░░███░░░░░░▄▀░░░░░░█░░░░▄▀░░██░░▄▀░░░░█
█░░▄▀░░██░░▄▀░░█░░▄▀░░████░░▄▀░░███████░░▄▀░░███████░░▄▀▄▀░░▄▀▄▀░░███
█░░▄▀░░██░░▄▀░░█░░▄▀░░░░░░░░▄▀░░███████░░▄▀░░███████░░░░▄▀▄▀▄▀░░░░███
█░░▄▀░░██░░▄▀░░█░░▄▀▄▀▄▀▄▀▄▀▄▀░░███████░░▄▀░░█████████░░▄▀▄▀▄▀░░█████
█░░▄▀░░██░░▄▀░░█░░▄▀░░░░░░▄▀░░░░███████░░▄▀░░███████░░░░▄▀▄▀▄▀░░░░███
█░░▄▀▄▀░░▄▀▄▀░░█░░▄▀░░██░░▄▀░░█████████░░▄▀░░███████░░▄▀▄▀░░▄▀▄▀░░███
█░░░░▄▀▄▀▄▀░░░░█░░▄▀░░██░░▄▀░░░░░░█████░░▄▀░░█████░░░░▄▀░░██░░▄▀░░░░█
███░░░░▄▀░░░░███░░▄▀░░██░░▄▀▄▀▄▀░░█████░░▄▀░░█████░░▄▀▄▀░░██░░▄▀▄▀░░█
█████░░░░░░█████░░░░░░██░░░░░░░░░░█████░░░░░░█████░░░░░░░░██░░░░░░░░█
█████████████████████████████████████████████████████████████████████
ʍǟֆȶɛʀʍɨռɖ-ʋʀȶӼ
"""

from pyrogram import Client, Filters, StopPropagation, InlineKeyboardButton, InlineKeyboardMarkup


@Client.on_message(Filters.command(["youtubelink"]), group=-2)
async def love(client, message):
    # return
    joinButton = InlineKeyboardMarkup([
        [InlineKeyboardButton("𝗘𝗗𝗠", url="https://t.me/joinchat/iltGypPXEbNhODY1")],
        [InlineKeyboardButton("𝗟𝗼-𝗙𝗶:", url="https://t.me/joinchat/A59waiPeCeQ5ODJl")],
        [InlineKeyboardButton("𝗧𝗿𝗮𝗽_𝗡𝗮𝘁𝗶𝗼𝗻:", url="https://t.me/joinchat/1xzYUF0HdFw3N2Fl")],
        [InlineKeyboardButton("𝗡𝗖𝗦:", url="https://t.me/joinchat/aHN50rUyUgphMDll")],
        [InlineKeyboardButton("RÈQÚÈ§†:", url="https://t.me/vrtxmusic")]
    ])
    youtube_ex = f"""
**Some example youtube channels and songs if you don't know what u want**📺
- type /love if i helped u anyway🍗🍔🍟🍕
    
[ʍǟֆȶɛʀʍɨռɖ-ʋʀȶӼ](https://telegra.ph/file/3f287a7ff7bd6d63fbd60.jpg)"""
    
    
    await message.reply_text(youtube_ex, reply_markup=joinButton)
    raise StopPropagation






